hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/HPM5E3Y_svd.xml
          <register>
            <name>ChanReqCtrl</name>
            <description>Channel &amp;index0 DMA Request Control Register</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x1F1F0000</resetMask>
            <fields>
              <field>
                <name>SRCREQSEL</name>
                <description>Source DMA request select. Select the request/ack handshake pair that the source device is connected to.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTREQSEL</name>
                <description>Destination DMA request select. Select the request/ack handshake pair that the destination device is connected to.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DstAddr</name>
            <description>Channel &amp;index0 Destination Address Low Part Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DSTADDRL</name>
                <description>Low part of the destination starting address. When the transfer completes, the value of {DstAddrH,DstAddrL} is updated to the ending address.
This address must be aligned to the destination transfer size; otherwise the error event will be triggered.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SwapTable</name>
            <description>swap table register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TABLE</name>
                <description>"4bit for one byte, define how to swap, default is no swap.
For HDMA, support up to 4-byte, the register default value is 0x3210"</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LLPointer</name>
            <description>Channel &amp;index0 Linked List Pointer Low Part Register</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFE0</resetMask>
            <fields>
              <field>
                <name>LLPOINTERL</name>
                <description>Low part of the pointer to the next descriptor. The pointer must be 32byte aligned.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>27</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="HDMA">
      <name>XDMA</name>
      <description>XDMA</description>
      <groupName>DMAV2</groupName>
      <baseAddress>0xf3100000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PPI</name>
      <description>PPI</description>
      <groupName>PPI</groupName>
      <baseAddress>0xf00cc000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>glb_cfg</name>
          <description>glb_cfg</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>PAD_OUT_REG_ENJ</name>
              <description>0:  register output, one cycle delay;
1:  direct output， no delay but may have timing issue</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_RESET</name>
              <description>software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pad_cfg</name>
          <description>pad_cfg</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x0F000000</resetValue>
          <resetMask>0x0F00FFFF</resetMask>
          <fields>
            <field>
              <name>CS_IDLE_ST</name>
              <description>cs pin idle state, default high for active low</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_PAD_OE</name>
              <description>the pad output enable signal. 0 for IN; 1 for OUT.
NOTE: for unused pads, set both ctrl_pad_oe and ctrl_pad_pol to 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_PAD_POL</name>
              <description>for OUT pad:
0: output the value in cmd
1: output reversed value in cmd
for IN pad, defines the signal active value,  when ctrl_cfg.io_cfg is set,
will wait the active value for ready(generally read or write ready)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clkpin_cfg</name>
          <description>clkpin_cfg</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F23</resetMask>
          <fields>
            <field>
              <name>CYCLE</name>
              <description>there will be a system counter run from 0 to cycle,
clk output will be set to high when counter is clk_high, and low when counter is clk_low.
The output will be system clock if cycle is 0.
All 4 CS share same clock configuration(one clock pin with configured frequency).
different CS can be assert at different  counter value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGH</name>
              <description>clock high numer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOW</name>
              <description>clock low number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVERT</name>
              <description>set to invert clock output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AON</name>
              <description>0:  use clk_gate in cmd sequence for whether output clock
1: always enable clock output;</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>set to enable clock logic</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>tm_cfg</name>
          <description>tm_cfg</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00010FFF</resetMask>
          <fields>
            <field>
              <name>TM_EN</name>
              <description>timeout enable.
if enabled, then if each AHB transfer time exceed tm_cfg clock cycles, will assert irq</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TM_CFG</name>
              <description>timeout value, max 20us at 200MHz clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts</name>
          <description>irq_sts</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>IRQ_TMOUT_STS</name>
              <description>tiemout interrupt status, write 1 to clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_en</name>
          <description>irq_en</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>IRQ_TMOUT_EN</name>
              <description>timeout interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CS[%s]</name>
          <description>no description available</description>
          <addressOffset>0x40</addressOffset>
          <register>
            <name>cfg0</name>
            <description>cfg0</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0FFF0FFF</resetMask>
            <fields>
              <field>
                <name>ADDR_END</name>
                <description>No description available</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDR_START</name>
                <description>addr_start and addr_end config the address slot for CS0, use high 12bit,
the minimun slot is 1Mbyte(addr_start==addr_end)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg1</name>
            <description>cfg1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0xFFFF0000</resetValue>
            <resetMask>0xFFFF000F</resetMask>
            <fields>
              <field>
                <name>ADDR_MASK</name>
                <description>the high AHB address will AND with {cs0_mask[15:0], 16'hFFFF},
shift right with addr_shift, then output as real address.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDR_SHIFT</name>
                <description>gennerally should be configured according to port size,
0 for 8bit; 1 for 16bit; 2 for 32bit;</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg2</name>
            <description>cfg2</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x10F010FF</resetMask>
            <fields>
              <field>
                <name>CS_SYNC_EN</name>
                <description>set to enable CS pin sync with clock counter.
Clr if use async mode(no clk pin), or not care the CS start time with clk pin</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC_CLK_SEL</name>
                <description>CS assert at when clk_div_cnt equal to sync_clk_sel</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>READY_IN_SEL</name>
                <description>0: use two stage sync;
1: use one stage sync</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INTER_CMD_DLY</name>
                <description>set to none-zero value, will add delay between each command sequence for burst cmd,
or splited transfer cmd sequence(such as transfer 32bit on 16bit port),
CS will be de-assert during the delay.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DM_POLARITY</name>
                <description>dm polarity</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PORT_SIZE</name>
                <description>00-8bit; 01-16bit; 10-32bit; 11-reserved</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>CS enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg3</name>
            <description>cfg3</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3F3F3F3F</resetMask>
            <fields>
              <field>
                <name>RCMD_END1</name>
                <description>sequential read cmd end index</description>
                <bitOffset>24</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RCMD_START1</name>
                <description>sequential read cmd start index</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RCMD_END0</name>
                <description>first read cmd end index</description>
                <bitOffset>8</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RCMD_START0</name>
                <description>first read cmd start index</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg4</name>
            <description>cfg4</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x3F3F3F3F</resetValue>
            <resetMask>0x3F3F3F3F</resetMask>
            <fields>
              <field>
                <name>WCMD_END1</name>
                <description>sequential write cmd end index</description>
                <bitOffset>24</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WCMD_START1</name>
                <description>sequential write cmd start index</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WCMD_END0</name>
                <description>first write cmd end index</description>
                <bitOffset>8</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WCMD_START0</name>
                <description>first write cmd start index</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>64</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,rsv60,61,62,63</dimIndex>
          <name>CMD[%s]</name>
          <description>no description available</description>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>cmd_cfg</name>
            <description>cmd_cfg</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000300FF</resetMask>
            <fields>
              <field>
                <name>CS_VAL</name>
                <description>cs value in current cmd</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CLK_GATE</name>
                <description>the clock gate enable signal, set to output clock signal</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CYCLE_NUM</name>
                <description>cmd clock cycles</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ad_cfg</name>
            <description>ad_cfg</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>DIR3</name>
                <description>No description available</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AD_SEL3</name>
                <description>No description available</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BYTE_SEL3</name>
                <description>No description available</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIR2</name>
                <description>No description available</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AD_SEL2</name>
                <description>No description available</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BYTE_SEL2</name>
                <description>No description available</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIR1</name>
                <description>No description available</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AD_SEL1</name>
                <description>No description available</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BYTE_SEL1</name>
                <description>No description available</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIR0</name>
                <description>0 for OUT; 1 for IN</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AD_SEL0</name>
                <description>0 for data; 1 for address.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BYTE_SEL0</name>
                <description>select one of the 4 bytes(11 for 31:24,  10 for 23:16, 01 for 15:8, 00 for 7:0)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
