hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/HPM5E3Y_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="QEI0">
      <name>QEI1</name>
      <description>QEI1</description>
      <groupName>QEIV2</groupName>
      <baseAddress>0xf0404000</baseAddress>
    </peripheral>
    <peripheral>
      <name>QEO0</name>
      <description>QEO0</description>
      <groupName>QEOV2</groupName>
      <baseAddress>0xf0410000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x21c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WAVE_mode</name>
          <description>analog waves mode</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF7</resetMask>
          <fields>
            <field>
              <name>WAVE2_ABOVE_MAX_LIMIT</name>
              <description>wave2 above max limit mode.
0: output all bits are 1.
1: output 0x0.
2: output as level_max_limit2.level0_max_limit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_HIGH_AREA1_LIMIT</name>
              <description>wave2 high area1 limit mode.
0: output all bits are 1.
1: output as level_max_limit2.level0_max_limit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_HIGH_AREA0_LIMIT</name>
              <description>wave2 high area0 limit mode.
0: output all bits are 1.
1: output as level_max_limit2.level0_max_limit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_LOW_AREA1_LIMIT</name>
              <description>wave2 low area1 limit mode.
0: output 0.
1: output as level_min_limit2.level1_min_limit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_LOW_AREA0_LIMIT</name>
              <description>wave2 low area0 limit mode.
0: output 0.
1: output as level_min_limit2.level1_min_limit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_BELOW_MIN_LIMIT</name>
              <description>wave2 below min limit mode.
0: output 0.
1: output all bits are 1.
2: output as level_min_limit2.level1_min_limit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_ABOVE_MAX_LIMIT</name>
              <description>wave1 above max limit mode.
0: output all bits are 1.
1: output 0x0.
2: output as level_max_limit1.level0_max_limit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_HIGH_AREA1_LIMIT</name>
              <description>wave1 high area1 limit mode.
0: output all bits are 1.
1: output as level_max_limit1.level0_max_limit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_HIGH_AREA0_LIMIT</name>
              <description>wave1 high area0 limit mode.
0: output all bits are 1.
1: output as level_max_limit1.level0_max_limit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_LOW_AREA1_LIMIT</name>
              <description>wave1 low area1 limit mode.
0: output 0.
1: output as level_min_limit1.level1_min_limit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_LOW_AREA0_LIMIT</name>
              <description>wave1 low area0 limit mode.
0: output 0.
1: output as level_min_limit1.level1_min_limit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_BELOW_MIN_LIMIT</name>
              <description>wave1 below min limit mode.
0: output 0.
1: output all bits are 1.
2: output as level_min_limit1.level1_min_limit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_ABOVE_MAX_LIMIT</name>
              <description>wave0 above max limit mode.
0: output all bits are 1.
1: output 0x0.
2: output as level_max_limit0.level0_max_limit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_HIGH_AREA1_LIMIT</name>
              <description>wave0 high area1 limit mode.
0: output all bits are 1.
1: output as level_max_limit0.level0_max_limit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_HIGH_AREA0_LIMIT</name>
              <description>wave0 high area0 limit mode.
0: output all bits are 1.
1: output as level_max_limit0.level0_max_limit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_LOW_AREA1_LIMIT</name>
              <description>wave0 low area1 limit mode.
0: output 0.
1: output as level_min_limit0.level1_min_limit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_LOW_AREA0_LIMIT</name>
              <description>wave0 low area0 limit mode.
0: output 0.
1: output as level_min_limit0.level1_min_limit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_BELOW_MIN_LIMIT</name>
              <description>wave0 below min limit mode.
0: output 0.
1: output all bits are 1.
2: output as level_min_limit0.level1_min_limit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDLE_TYPE</name>
              <description>saddle type seclect;
0:standard saddle.
1: triple-cos saddle.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_DQ_VALID</name>
              <description>enable vd or vq valid to trigger analog wave calcuation
0: disable.
1: enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_POS_VALID</name>
              <description>enable position valid to trigger analog wave calcuation
0: disable.
1: enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WAVE_VD_VQ_INJECT</name>
              <description>wave VdVq inject enable.
0: disable VdVq inject.
1: enable VdVq inject.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VD_VQ_SEL</name>
              <description>vd_vq sel ctrl:
0: from CLC.
1: from software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVES_OUTPUT_TYPE</name>
              <description>wave0/1/2 output mode.
0: cosine wave.
1: saddle wave.
2. abs cosine wave.
3. saw wave</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_resolution</name>
          <description>resolution of wave0/1/2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINES</name>
              <description>wave0/1/2 resolution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_PHASE_SHIFT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave0 phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^32) period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_vd_inject</name>
          <description>wave vd inject value</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VD_VAL</name>
              <description>Vd inject value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_vq_inject</name>
          <description>wave vq inject value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VQ_VAL</name>
              <description>Vq inject value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_vd_vq_load</name>
          <description>load wave0/1/2 vd vq value</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LOAD</name>
              <description>load wave0/1/2 vd vq value.  always read 0
0: vd vq keep previous value.
1: load wave0/1/2 vd vq value at sametime.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_AMPLITUDE[%s]</name>
          <description>no description available</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>EN_SCAL</name>
              <description>enable wave amplitude scaling. 0: disable; 1: enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_VAL</name>
              <description>amplitude scaling value. bit15-12 are integer part value. bit11-0 are fraction value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_MID_POINT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave0 output middle point, use this value as 32 bit signed value. bit 31 is signed bit. bit30-27 is integer part value. bit26-0 is fraction value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_LIMIT0[%s]</name>
          <description>no description available</description>
          <addressOffset>0x48</addressOffset>
          <register>
            <name>min_level0</name>
            <description>wave0 low area limit value</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LIMIT_LEVEL0</name>
                <description>low area limit level0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>max_level0</name>
            <description>wave0 high area limit value</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LIMIT_LEVEL0</name>
                <description>high area limit level0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_LIMIT1[%s]</name>
          <description>no description available</description>
          <addressOffset>0x60</addressOffset>
          <register>
            <name>min_level1</name>
            <description>wave0 low area limit value level1</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LIMIT_LEVEL1</name>
                <description>low area limit level1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>max_level1</name>
            <description>wave0 high area limit value level1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LIMIT_LEVEL1</name>
                <description>high area limit level1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_DEADZONE_SHIFT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave0 deadzone shifter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_pwm_cycle</name>
          <description>pwm_cycle</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>pwm_cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_filter</name>
          <description>wave input position filter</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave_filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ABZ_mode</name>
          <description>wave_a/b/z output mode</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x99111333</resetMask>
          <fields>
            <field>
              <name>ABZ_OUTPUT_ENABLE</name>
              <description>abz output enable：
0：abz output disable, all keep 0
1：abz output enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REVERSE_EDGE_TYPE</name>
              <description>pulse reverse wave，reverse edge point:
0: between pulse's posedge and negedge, min period dedicated by the num line_width
1: edge change point flow pulse's negedge.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSITION_SYNC_MODE</name>
              <description>position sync mode:
0: only sync integer line part into qeo own position.
1: sync integer and fraction part into qeo own position.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WDOG</name>
              <description>enable abz wdog:
0: disable abz wdog.
1: enable abz wdog.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Z_POLARITY</name>
              <description>wave_z polarity.
0: normal output.
1: invert normal output</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_POLARITY</name>
              <description>wave_b polarity.
0: normal output.
1: invert normal output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_POLARITY</name>
              <description>wave_a polarity.
0: normal output.
1: invert normal output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Z_TYPE</name>
              <description>wave_z type:
0: zero pulse type, start and end line number decided by z_start、z_end and z_offset.
1: zero pulse type, z output start to high when position= z_start, and mantain numbers of 1/4 line cfg in z_pulse_width register
2: reserved
3: wave_z output as tree-phase wave same as wave_a/wave_b</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_TYPE</name>
              <description>wave_b type:
0: Two-phase orthogonality wave_b.
1: reverse wave of pulse/reverse type.
2: down wave of up/down type.
3: Three-phase orthogonality wave_b.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_TYPE</name>
              <description>wave_a type:
0: Two-phase orthogonality wave_a.
1: pulse wave of pulse/reverse type.
2: up wave of up/down type.
3: Three-phase orthogonality wave_a.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ABZ_resolution</name>
          <description>resolution of wave_a/b/z</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINES</name>
              <description>wave_a/b/z resolution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
