hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/HPM5E3Y_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PDGO</name>
      <description>PDGO</description>
      <groupName>PDGO</groupName>
      <baseAddress>0xf4134000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2b0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DGO_TURNOFF</name>
          <description>Trunoff Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>trunoff counter, counter stops when it counts down to 0, the trunoff occurs when the counter value is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DGO_RC32K_CFG</name>
          <description>RC32K CLOCK TRIM Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>IRC32K trim happened, this bit set by hardware after trim value loaded, and stop load, write 0 will clear this bit and reload trim value
0: irc is not trimmed
1: irc is trimmed</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPEX7_TRIM</name>
              <description>IRC32K bit 7</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPEX6_TRIM</name>
              <description>IRC32K bit 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_TRIM</name>
              <description>capacitor trim bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DGO_CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RET</name>
              <description>Retention, retain contents in DGO.GPR[n] register after RSTN (When PMIC has power)
0: Disable
1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LESP</name>
              <description>Bandgap works in power save mode, bandgap function normally
0: bandgap works in high performance mode
1: bandgap works in power saving mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWP</name>
              <description>Bandgap works in low power mode, bandgap function limited
0: bandgap works in normal mode
1: bandgap works in low power mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN_CTRL</name>
          <description>IO Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSTN</name>
              <description>resetn pin pull up disable
0: Enable Pull Up
1: Disable Pull Up</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>wakeup pin pull down disable
0: Enable Pull Down
1: Disable Pull Down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO3</name>
              <description>WUIO pin pull down disable
0: Enable Pull Down
1: Disable Pull Down</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO2</name>
              <description>WUIO pin pull down disable
0: Enable Pull Down
1: Disable Pull Down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO1</name>
              <description>WUIO pin pull down disable
0: Enable Pull Down
1: Disable Pull Down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO0</name>
              <description>WUIO pin pull down disable
0: Enable Pull Down
1: Disable Pull Down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN_STS</name>
          <description>IO Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMOD</name>
              <description>TMOD Pin Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTN</name>
              <description>RSTN Pin Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>WKUP pin status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUIO3</name>
              <description>WUIO3 pin status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUIO2</name>
              <description>WUIO2 pin status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUIO1</name>
              <description>WUIO1 pin status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUIO0</name>
              <description>WUIO0 pin status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP</name>
          <description>Wakeup Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>software wake-up counter，counter stops when it counts down(base on 32KHz clock) to 0, the wakeup occurs when the counter value is 1.
wakeup once: write counter value here and set CYCLE register to be 0.
wakeup in cycle: write wakeup cycle in CYCLE register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_CYC</name>
          <description>Wakeup Cycle Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>interval between wakeups, count by 32KHz clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_EN</name>
          <description>Wakeup Enable Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCNT0</name>
              <description>Allow wake-up via Pulse PCNT0 events.
0：Disable
1：Enable
Note: wake-up interrupt request shloud be enable at the same time.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAP0</name>
              <description>Allow wake-up via PCAP0 events.
0：Disable
1：Enable
Note: wake-up interrupt request shloud be enable at the same time.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO</name>
              <description>Allow wake-up via WU00/WU01/WU02/WU03 pins.
0：Disable
1：Enable
Note: wake-up interrupt request shloud be enable at the same time.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CYC</name>
              <description>Allow software wake-up via counter cycle.
0：Disable
1：Enable
Note: wake-up interrupt request shloud be enable at the same time.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>Allow wake-up via the WKUP pin.
0：Disable
1：Enable
Note: wake-up interrupt request shloud be enable at the same time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_STS</name>
          <description>Wakeup Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCNT0</name>
              <description>PCNT0 events wake-up status.
0: wake-up is invalid
1: wake-up is valid</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCAP0</name>
              <description>PCAP0 events wake-up status.
0: wake-up is invalid
1: wake-up is valid</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUIO</name>
              <description>WUIO0/WUIO1/WUIO2/WUIO3 pins wake-up status.
0: wake-up is invalid
1: wake-up is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CYC</name>
              <description>counter cycle software wake-up status.
0: wake-up is invalid
1: wake-up is valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>WKUP pin wake-up status.
0: wake-up is invalid
1: wake-up is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ0_EN</name>
          <description>Interrupt 0 Enable Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYC</name>
              <description>Allow software counter cycle wake-up interrupt request.
0：Disable
1：Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>Allow WKUP Pin wake-up interrupt request.
0：Disable
1：Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO3</name>
              <description>Allow WUIO3 Pin wake-up interrupt request.
0：Disable
1：Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO2</name>
              <description>Allow WUIO2 wake-up interrupt request.
0：Disable
1：Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO1</name>
              <description>Allow WUIO1 wake-up interrupt request.
0：Disable
1：Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUIO0</name>
              <description>Allow WUIO0 wake-up interrupt request.
0：Disable
1：Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ0_STS</name>
          <description>Interrupt 0 Status Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYC</name>
              <description>software counter cycle wake-up interrupt status.
0： is invalid
1： is valid</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>WKUP Pin wake-up interrupt status.
0： is invalid
1： is valid</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUIO3</name>
              <description>WUIO3 Pin wake-up interrupt status.
0： is invalid
1： is valid</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUIO2</name>
              <description>WUIO2 wake-up interrupt status.
0： is invalid
1： is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUIO1</name>
              <description>WUIO1 wake-up interrupt status.
0： is invalid
1： is valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUIO0</name>
              <description>WUIO0 wake-up interrupt status.
0： is invalid
1： is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ1_EN</name>
          <description>Interrupt 1 Enable Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCNT0_SEQERR</name>
              <description>Allow pulse counter interrupt request when phase sequence error happens.
0：Disable
1：Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0_DECERR</name>
              <description>Allow pulse counter interrupt request when decoder error happens.
0：Disable
1：Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0_TACHO</name>
              <description>Allow pulse counter interrupt request when tacho done happens.
0：Disable
1：Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0_MATCH0</name>
              <description>Allow pulse counter interrupt request when match 0 events happens.
0：Disable
1：Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0_HOME</name>
              <description>Allow pulse counter interrupt request when Phase h (HOME)  edges or level match events happens.
0：Disable
1：Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0_Z</name>
              <description>Allow pulse counter interrupt request when Phase Z (INDEX)  edges or level match events happens.
0：Disable
1：Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0_UPDATE</name>
              <description>Allow pulse counter interrupt request when counter updates.
0：Disable
1：Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAP0_MATCH</name>
              <description>Allow PCAP0 interrupt request when match events happens.
0：Disable
1：Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAP0_DUMP</name>
              <description>Allow PCAP0 interrupt request when dump events happens.
0：Disable
1：Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAP0_PERIOD</name>
              <description>Allow PCAP0 interrupt request when period done.
0：Disable
1：Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
