hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/HPM5E3Y_svd.xml
        <register>
          <name>IRQ1_STS</name>
          <description>Interrupt 1 Status Register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCNT0_SEQERR</name>
              <description>pulse counter interrupt status when phase sequence error happens.
0： is invalid
1： is valid</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0_DECERR</name>
              <description>pulse counter interrupt status when decoder error happens.
0： is invalid
1： is valid</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0_TACHO</name>
              <description>pulse counter interrupt status when tacho done happens.
0： is invalid
1： is valid</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0_MATCH0</name>
              <description>pulse counter interrupt status when match 0 events happens.
0： is invalid
1： is valid</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0_HOME</name>
              <description>pulse counter interrupt status when Phase H (HOME) edges or level match events happens.
0： is invalid
1： is valid</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0_Z</name>
              <description>pulse counter interrupt status when Phase Z (INDEX) edges or level match events happens.
0： is invalid
1： is valid</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0_UPDATE</name>
              <description>pulse counter interrupt status when counter updates.
0： is invalid
1： is valid</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCAP0_MATCH</name>
              <description>PCAP0 interrupt status when match events happens.
0： is invalid
1： is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCAP0_DUMP</name>
              <description>PCAP0 interrupt status when dump events happens.
0： is invalid
1： is valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCAP0_PERIOD</name>
              <description>PCAP0 interrupt status when period done.
0： is invalid
1： is valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>GPR[%s]</name>
          <description>no description available</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>IOFILTER[%s]</name>
          <description>no description available</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Allow this IO filter channel output
0： Disable
1： Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQMODE</name>
              <description>Filter IRQ Mode:
0： Disable
1： Level Mode
2： Rising Edge
3： Rising Edge or Falling Edge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NORM</name>
              <description>Initial output value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Invert Filter output result.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass Mode
0： Disable Bypass Mode
1： Enable Bypass Mode, use filter input as result output</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Filter Mode:
0： Rapid change mode
1： Delay filter mode
2： Stalbe low mode
3： Stable high mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_LEN</name>
              <description>Filter Length(Base on 32K clock)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimIndex>0</dimIndex>
          <name>PCAP[%s]</name>
          <description>no description available</description>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Pulse Capture Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable PCAP counter
0： Disable
1： Enable
Note:  Other registers should be configured before enable this bit.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SELECT</name>
                <description>Select Input for counter:
0:  Use WUIO0 as input
1:  Use WUIO1 as input
2:  Use WUIO2 as input
3:  Use WUIO3 as input</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MATCH_MODE</name>
                <description>Match Mode Selection. Generate Match Pulse when :
0   : Disable Match Mode;
1   : Reserved;
2   : COUNTER &gt;= COMPARE;
3   : COUNTER &lt;= COMPARE;
4   : HIGH_DUMP &gt;= COMPARE;
5   : HIGH_DUMP &lt;= COMPARE;
6   : LOW_DUMP &gt;= COMPARE;
7   : LOW_DUMP &lt;= COMPARE;
8   : (HIGH_DUMP  + LOW_DUMP) &gt;= COMPARE;
9   : (HIGH_DUMP  + LOW_DUMP) &lt;= COMPARE;
10 :  | HIGH_DUMP  - LOW_DUMP | &gt;= COMPARE;
11 :  | HIGH_DUMP  - LOW_DUMP | &lt;= COMPARE;
12 :  | HIGH_DUMP  - LOW_DUMP | &gt;= COMPARE and HIGH_DUMP &gt;= LOW_DUMP;
13 :  | HIGH_DUMP  - LOW_DUMP | &lt;= COMPARE and LOW_DUMP &gt;= HIGH_DUMP;
14 :  | HIGH_DUMP  - LOW_DUMP | &gt;= COMPARE and HIGH_DUMP &lt;= LOW_DUMP;
15 :  | HIGH_DUMP  - LOW_DUMP | &lt;= COMPARE and LOW_DUMP &lt;= HIGH_DUMP;</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DUMP_MODE</name>
                <description>Dump Mode, select the time using to update LOW_DUMP(input signal's low level time) and HIGH_DUMP(input signal's high level time):
00: Disable Dump
01: Update at rising edge. (input selection via SELECT bit field)
10: Update at falling edge.  (input selected via SELECT bit field)
11: Update when COUNTER counts period done.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>COUNT_MODE</name>
                <description>Count Mode
- when Bit[0]:
0: Count up
1: Count down
- when Bit[1]:
0: Oneshot mode
1: Period Mode
- when Bit[3:2]:
00: Count by internal 32KHz clock
01: Count updates when rising edge
10: Count updates when falling edge</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CP_CFG</name>
            <description>Compare and  Period Configuration Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COMPARE</name>
                <description>Compare Value
Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PERIOD</name>
                <description>Period Value
Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTER</name>
            <description>Counter Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COUNTER</name>
                <description>Counter Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUMP</name>
            <description>DUMP Register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOW_DUMP</name>
                <description>Dump Value: Low Level Time(Base on 32K Clock)</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HIGH_DUMP</name>
                <description>Dump Value: High Level Time(Base on 32K Clock)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x30</dimIncrement>
          <dimIndex>0</dimIndex>
          <name>PCNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x280</addressOffset>
          <register>
            <name>CNT_CFG</name>
            <description>Pulse Count Configuration Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable Pulse Counter
0： Disable
1： Enable
Note:  Other registers should be configured before enable this bit.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVRD</name>
                <description>Software Override Direction
0： Disable
1： Enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SEQ</name>
                <description>Change the direction of decoder
0： Disable
1： Enable
If enable：
In PD Mode：modify the positive direction by using high level in D channel as forward .
In UD Mode：modify the positive direction by using pulse in U channel as forward, pulse in D channel as reverse.
In ABZ Mode：modify the positive direction by using B channel's phase lead over A channel as forward.
In UVW Mode：modify the positive direction by using W channel lead as forward.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BIAS</name>
                <description>Bias compensation, compensation for decoded phase</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DECODE_MODE</name>
                <description>Decode Mode:
0: MODE_AB_4X
1: MODE_AB_2X
2: MODE_AB_1X
3: Reserved
4: MODE_PD_1X
5: MODE_PDF1X（Disable checking of direction change when input pulse is valid）
6: MODE_PD_2X
7: MODE_PDF2X（Disable checking of direction change when input pulse is valid）
8: MODE_UD_1X
9: MODE_UDF1X（Disable checking if both channel U and D are valid at the same time）
10: MODE_UD_2X
11: MODE_UDF2X（Disable checking if both channel U and D are valid at the same time）
12: MODE_UVW6X (120°)
13: MODE_UVW6Y (  60°)
14: Reserved
15: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CALIB_CFG</name>
            <description>Calibration Configuration Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZMODE</name>
                <description>Phase Z Mode Select
0：Disable
1：Edge Mode(Use Edge in ZSTATE Register)
2：Level Mode(Match Phase A,B and Z)
3：Level Mode(Only Match Phase Z)</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ZSTATE</name>
                <description>Phase Z Matching Status
-When in level mode:
A bit2 of 1 indicates at the rising edge of the Z phase, and 0 at the falling edge.
The remaining bits correspond to the level state of the HZBA phase.
-When edge mode:
If bit3 is 1: Match Z-phase rising edge, reverse
If bit2 is 1: Match Z-phase falling edge, forward
If bit1 is 1: Match Z-phase falling edge, reverse
If bit0 is 1: Match Z-phase rising edge, forward.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>H_SEL</name>
                <description>Select Input for Phase H：
0：WUIO0
1：WUIO1
2：WUIO2
3：WUIO3</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>Z_SEL</name>
                <description>Select Input for Phase Z：
0：WUIO0
1：WUIO1
2：WUIO2
3：WUIO3</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>B_SEL</name>
                <description>Select Input for Phase B：
0：WUIO0
1：WUIO1
2：WUIO2
3：WUIO3</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>A_SEL</name>
                <description>Select Input for Phase A：
0：WUIO0
1：WUIO1
2：WUIO2
3：WUIO3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESOLUTION</name>
            <description>Resolution Configuration Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RESOLUTION</name>
                <description>Resolution Value
Note：The Field in this register is the same as COUNTER register, so if target resolution value is TARGET_LINES , it should be shifted according to the current DECODE_MODE, and then decrease 1 because it counts from 0, it means when:
MODE_AB_4X: RESOLUTION = (TARGET_LINES &lt;&lt; 2) - 1;
MODE_AB_2X: RESOLUTION = (TARGET_LINES &lt;&lt; 1) - 1;
MODE_AB_1X: RESOLUTION = (TARGET_LINES &lt;&lt; 0) - 1;
MODE_PD_1X: RESOLUTION = (TARGET_LINES &lt;&lt; 0) - 1;
MODE_PDF1X: RESOLUTION = (TARGET_LINES &lt;&lt; 0) - 1;
MODE_PD_2X: RESOLUTION = (TARGET_LINES &lt;&lt; 1) - 1;
MODE_PDF2X: RESOLUTION = (TARGET_LINES &lt;&lt; 1) - 1;
MODE_UD_1X: RESOLUTION = (TARGET_LINES &lt;&lt; 0) - 1;
MODE_UDF1X: RESOLUTION = (TARGET_LINES &lt;&lt; 0) - 1;
MODE_UD_2X: RESOLUTION = (TARGET_LINES &lt;&lt; 1) - 1;
MODE_UDF2X: RESOLUTION = (TARGET_LINES &lt;&lt; 1) - 1;
MODE_UVW6X: RESOLUTION = (TARGET_LINES &lt;&lt; 3) - 1;
MODE_UVW6Y: RESOLUTION = (TARGET_LINES &lt;&lt; 3) - 1;</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
